
# Регулярное выражение для проверки имени пользователя
USERNAME_REGEX = r'^[\w.@+-]+\Z'
# Минимальное время приготовления в минутах
MIN_COOKING = 1
# Максимальное время приготовления в минутах (1 неделя)
MAX_COOKING = 10080
# Минимальное количество ингредиентов
MIN_AMOUNT = 1
# Максимальное количество ингредиентов
MAX_AMOUNT = 42000
# Максимальная длина строки USERNAME
MAX_LENGTH_USERNAME = 150
# Максимальная длина строки FIRST_NAME
MAX_LENGTH_F_NAME = 150
# Максимальная длина строки LAST_NAME
MAX_LENGTH_L_NAME = 150
